<?php



return array(
    /*
      |--------------------------------------------------------------------------
      | Validation Language Lines
      |--------------------------------------------------------------------------
      |
      | The following language lines contain the default error messages used by
      | the validator class. Some of these rules have multiple versions such
      | such as the size rules. Feel free to tweak each of these messages.
      |
     */

    "accepted" => ":ویژگی باید پذیرفته شود.",
    "active_url" => ":خصیصۀ باید یک نشانی وب معتبر باشد.",
    "after" => ":ویژگی باید یک تاریخ مسن تر از باشد: تاریخ.",
    "alpha" => ":ویژگی باید تنها حروف تشکیل شده است.",
    "alpha_dash" => ":ویژگی فقط باید از حروف ، اعداد و خط تیره تشکیل شده است.",
    "alpha_num" => ":ویژگی باید تنها حروف و اعداد باشد.",
    "array" => ":ویژگی باید یک آرایه باشد.",
    "before" => ":ویژگی باید یک تاریخ مسن تر از باشد: تاریخ.",
    "between" => array(
        "numeric" => ":ویژگی باید بین باشد: حداقل -: حداکثر.",
        "file" => ":ویژگی باید یک مقدار کیلوبایت بین باشد: حداقل -: حداکثر.",
        "string" => ":ویژگی باید شامل :حداقل -: حداکثر شخصیت.",
        "array" => ":ویژگی باید شی بین دارند :حداقل -: حداکثر."
    ),
    "distinct" => ":ویژگی نباید داده های تکراری.",
    "confirmed" => ":ویژگی تکرار مطابقت ندارد.",
    "date" => ":خصیصه باید یک تاریخ معتبر باشد.",
    "date_format" => ":ویژگی :فرمت می کند فرمت مطابقت ندارد.",
    "different" => ":ویژگی و: دیگر باید متفاوت از یکدیگر باشد.",
    "digits" => ":ویژگی: رقم باید رقم باشد.",
    "digits_between" => ":ویژگی باید یک رقمی بین باشد: حداقل و :حداکثر.",
    "email" => ":فرمت ویژگی نامعتبر است.",
    "exists" => "برگزیده :خصیصه نامعتبر است.",
    "image" => ":فیلد ویژگی باید یک فایل تصویری باشد.",
    "in" => ":مقدار خصیصه نامعتبر است.",
    "integer" => ":ویژگی باید یک رقم باشد.",
    "ip" => ":خصیصه باید یک آدرس پروتکل اینترنت معتبر باشد.",
    "max" => array(
        "numeric" => ":مقدار ویژگی باید کمتر از باشد: حداکثر.",
        "file" => ":مقدار ویژگی باید کمتر از باشد: حداکثر کیلوبایت.",
        "string" => ":مقدار ویژگی باید کمتر از باشد: حداکثر مقدار کاراکتر.",
        "array" => ":مقدار ویژگی باید کمتر از :حداکثر تعداد اشیاء."
    ),
    "mimes" => ":فرمت فایل ویژگی باید :ارزش.",
    "min" => array(
        "numeric" => ":مقدار خصیصه باید بیشتر از: حداقل.",
        "file" => ":مقدار ویژگی باید بیشتر از باشد: حداقل کیلوبایت.",
        "string" => ":مقدار خصیصه باید بیشتر از باشد: ارزش شخصیت حداقل.",
        "array" => ":ویژگی باید حداقل :حداقل شی."
    ),
    "not_in" => "برگزیده :خصیصه نامعتبر است.",
    "numeric" => ":ویژگی باید یک رقم باشد.",
    "regex" => ":فرمت ویژگی نامعتبر است.",
    'not_regex' => ':ویژگی شامل شخصیت های ناسازگار (ı, ş, ü vb.)',
    "required" => ":درست ویژگی مورد نیاز است.",
    "required_if" => ":مورد نیاز که درست ویژگی است :دیگر :ارزش.",
    "required_with" => ":مورد نیاز در هنگام ویژگی درست :ارزش.",
    "required_with_all" => ":مورد نیاز در هنگام ویژگی درست :ارزش.",
    "required_without" => ":مورد نیاز زمانی که درست ویژگی :ارزش وجود ندارد.",
    "required_without_all" => ":مورد نیاز هنگامی که فیلد ویژگی: مقادیر وجود ندارد.",
    "same" => ":ویژگی باید مطابقت :دیگر.",
    "size" => array(
        "numeric" => ":ویژگی باید باشد: اندازه.",
        "file" => ":ویژگی: اندازه باید کیلوبایت باشد.",
        "string" => ":ویژگی: اندازه باید یک شخصیت باشد.",
        "array" => ":ویژگی: باید اندازه شی داشته باشد."
    ),
    "unique" => ":ویژگی قبلاً ثبت شده است.",
    "url" => ":فرمت ویژگی نامعتبر است.",
    /*
      |--------------------------------------------------------------------------
      | Custom Validation Language Lines
      |--------------------------------------------------------------------------
      |
      | Here you may specify custom validation messages for attributes using the
      | convention "attribute.rule" to name the lines. This makes it quick to
      | specify a specific custom language line for a given attribute rule.
      |
     */
    'custom' => array(),
    /*
      |--------------------------------------------------------------------------
      | Custom Validation Attributes
      |--------------------------------------------------------------------------
      |
      | The following language lines are used to swap attribute place-holders
      | with something more reader friendly such as E-Mail Address instead
      | of "email". This simply helps us make messages a little cleaner.
      |
     */
    'attributes' => array(),
);