<?php



return array(
    /*
      |--------------------------------------------------------------------------
      | Validation Language Lines
      |--------------------------------------------------------------------------
      |
      | The following language lines contain the default error messages used by
      | the validator class. Some of these rules have multiple versions such
      | such as the size rules. Feel free to tweak each of these messages.
      |
     */

    "accepted" => ":يجب قبول السمة.",
    "active_url" => ":يجب أن تكون السمة عنوان URL صالحًا.",
    "after" => ":يجب أن تكون السمة تاريخًا أقدم من: التاريخ.",
    "alpha" => ":يجب أن تتكون السمة من أحرف فقط.",
    "alpha_dash" => ":يجب أن تتكون السمة فقط من أحرف وأرقام وشرطات.",
    "alpha_num" => ":يجب أن تحتوي السمة على أحرف وأرقام فقط.",
    "array" => ":يجب أن تكون السمة مصفوفة.",
    "before" => ":يجب أن تكون السمة تاريخًا أقدم من: التاريخ.",
    "between" => array(
        "numeric" => ":سمة يجب أن يكون بين :الحد الأدنى :الحد الأقصى.",
        "file" => ":يجب أن تكون السمة قيمة كيلوبايت بين: الحد الأدنى -: الحد الأقصى.",
        "string" => ":سمة يجب أن تتكون من :الحد الأدنى :الحد الأقصى الشخصيات.",
        "array" => ":سمة يجب أن يكون الكائن بين :الحد الأدنى :الحد الأقصى."
    ),
    "distinct" => ":يجب ألا تكون السمة بيانات مكررة.",
    "confirmed" => ":تكرار السمة لا يتطابق.",
    "date" => ":يجب أن تكون السمة تاريخًا صالحًا.",
    "date_format" => ":السمة: التنسيق لا يتطابق مع التنسيق.",
    "different" => ":السمة و: الآخر يجب أن يكون مختلفًا عن بعضهما البعض.",
    "digits" => ":السمة: يجب أن تكون الأرقام من الأرقام.",
    "digits_between" => ":يجب أن تكون السمة رقما بين: الحد الأدنى و: الحد الأقصى.",
    "email" => ":السمة تنسيق غير صالح.",
    "exists" => "سمة التنسيق غير صالحة.",
    "image" => ":Tيجب أن يكون حقل السمة ملف صورة.",
    "in" => ":قيمة السمة غير صالح.",
    "integer" => ":يجب أن تكون السمة رقمًا.",
    "ip" => ":يجب أن تكون السمة عنوان بروتوكول إنترنت صالحًا.",
    "max" => array(
        "numeric" => ":يجب أن تكون قيمة السمة أقل من: الحد الأقصى.",
        "file" => ":يجب أن تكون قيمة السمة أقل من: الحد الأقصى كيلوبايت.",
        "string" => ":يجب أن تكون قيمة السمة أقل من: الحد الأقصى لقيمة الحرف.",
        "array" => ":يجب أن تحتوي قيمة السمة على أقل من: الحد الأقصى لعدد العناصر."
    ),
    "mimes" => ":يجب أن يكون تنسيق ملف السمة: القيم.",
    "min" => array(
        "numeric" => ":يجب أن تكون قيمة السمة أكبر من: الحد الأدنى.",
        "file" => ":يجب أن تكون قيمة السمة أكبر من: الحد الأدنى كيلوبايت.",
        "string" => ":يجب أن تكون قيمة السمة أكبر من: الحد الأدنى لقيمة الأحرف.",
        "array" => ":يجب أن يكون السمة على الأقل: الحد الأدنى للكائن."
    ),
    "not_in" => "السمة المحددة: غير صالحة.",
    "numeric" => ":يجب أن تكون السمة رقما.",
    "regex" => ":السمة تنسيق غير صالح",
    'not_regex' => ':تحتوي السمة على أحرف غير متوافقة (ı، ş، ü vb.)',
    "required" => ":مطلوب حقل السمة.",
    "required_if" => ":مطلوب عندما يحتوي حقل السمة على: قيمة أخرى.",
    "required_with" => ":مطلوب عند حقل السمة: القيم.",
    "required_with_all" => ":مطلوب عند حقل السمة: القيم.",
    "required_without" => ":مطلوب عند حقل السمة: القيم غير موجودة.",
    "required_without_all" => ":مطلوب عند حقل السمة: القيم غير موجودة.",
    "same" => ":يجب أن تتطابق السمة مع: أخرى.",
    "size" => array(
        "numeric" => ":يجب أن تكون السمة: الحجم.",
        "file" => ":السمة: يجب أن يكون الحجم كيلوبايت.",
        "string" => ":السمة :يجب أن يكون حجم الحرف.",
        "array" => ":aالسمة: يجب أن يكون حجم الكائن."
    ),
    "unique" => ":تم تسجيل السمة بالفعل.",
    "url" => ":تنسيق السمة غير صالح.",
    /*
      |--------------------------------------------------------------------------
      | Custom Validation Language Lines
      |--------------------------------------------------------------------------
      |
      | Here you may specify custom validation messages for attributes using the
      | convention "attribute.rule" to name the lines. This makes it quick to
      | specify a specific custom language line for a given attribute rule.
      |
     */
    'custom' => array(),
    /*
      |--------------------------------------------------------------------------
      | Custom Validation Attributes
      |--------------------------------------------------------------------------
      |
      | The following language lines are used to swap attribute place-holders
      | with something more reader friendly such as E-Mail Address instead
      | of "email". This simply helps us make messages a little cleaner.
      |
     */
    'attributes' => array(),
);