<?php



return array(
    /*
      |--------------------------------------------------------------------------
      | Validation Language Lines
      |--------------------------------------------------------------------------
      |
      | The following language lines contain the default error messages used by
      | the validator class. Some of these rules have multiple versions such
      | such as the size rules. Feel free to tweak each of these messages.
      |
     */

    "accepted" => ":विशेषता को स्वीकार करना चाहिए।",
    "active_url" => ":विशेषता एक मान्य यूनिफ़ॉर्म रिसोर्स लोडर होना चाहिए।",
    "after" => ":विशेषता एक तारीख से अधिक पुरानी होनी चाहिए: तिथि । ",
    "alpha" => ":विशेषता में केवल अक्षर होने चाहिए।",
    "alpha_dash" => ":विशेषता में केवल अक्षर, संख्या और डैश शामिल होने चाहिए।",
    "alpha_num" => ":विशेषता में केवल अक्षर और संख्या होनी चाहिए।",
    "array" => ":विशेषता एक सरणी होनी चाहिए।",
    "before" => ":विशेषता :date से पुरानी तिथि होनी चाहिए।",
    "between" => array(
        "numeric" => ":विशेषता :न्यूनतम - :अधिकतम के बीच होनी चाहिए।",
        "file" => ":विशेषता :न्यूनतम - :अधिकतम के बीच एक किलोबाइट मान होनी चाहिए।",
        "string" => ":विशेषता :न्यूनतम - :अधिकतम के बीच एक किलोबाइट मान होनी चाहिए।",
        "array" => ":विशेषता के बीच वस्तु होनी चाहिए: न्यूनतम -: अधिकतम।"
    ),
    "distinct" => ":विशेषता डुप्लिकेट डेटा नहीं होनी चाहिए।",
    "confirmed" => ":विशेषता दोहराना मेल नहीं खाता । ",
    "date" => ":विशेषता दोहराना मेल नहीं खाता । ",
    "date_format" => ":विशेषता: प्रारूप प्रारूप से मेल नहीं खाता । ",
    "different" => ":विशेषता और: अन्य एक दूसरे से अलग होना चाहिए । ",
    "digits" => ":विशेषता: अंक अंक होना चाहिए । ",
    "digits_between" => ":विशेषता के बीच एक अंक होना चाहिए :न्यूनतम और: अधिकतम । ",
    "email" => ":विशेषता प्रारूप अमान्य है । ",
    "exists" => "चयनित: विशेषता अमान्य है । ",
    "image" => ":विशेषता फ़ील्ड एक छवि फ़ाइल होनी चाहिए । ",
    "in" => ":विशेषता मान अमान्य है । ",
    "integer" => ":विशेषता एक अंक होना चाहिए । ",
    "ip" => ":विशेषता एक मान्य इंटरनेट प्रोटोकॉल पता होना चाहिए । ",
    "max" => array(
        "numeric" => ":विशेषता मान से कम होना चाहिए: अधिकतम । ",
        "file" => ":विशेषता मान से कम होना चाहिए :अधिकतम किलोबाइट । ",
        "string" => ":The attribute value must be less than :maximum kilobyte.",
        "array" => ":विशेषता मान से कम होना चाहिए :वस्तुओं की अधिकतम संख्या।"
    ),
    "mimes" => ":विशेषता फ़ाइल प्रारूप होना चाहिए: मान।",
    "min" => array(
        "numeric" => ":विशेषता मान :न्यूनतम से अधिक होना चाहिए।",
        "file" => ":विशेषता मान :न्यूनतम किलोबाइट से अधिक होना चाहिए।",
        "string" => ":विशेषता मान :न्यूनतम वर्ण मान से अधिक होना चाहिए।",
        "array" => ":विशेषता में कम से कम :न्यूनतम वस्तु होनी चाहिए।"
    ),
    "not_in" => "चयनित :विशेषता मान्य है।",
    "numeric" => ":विशेषता एक अंक होनी चाहिए।",
    "regex" => ":विशेषता प्रारूप अमान्य है।",
    'not_regex' => ':विशेषता में असंगत वर्ण शामिल हैं (ı,ş,ü vb.)',
    "required" => ":विशेषता फ़ील्ड की आवश्यकता है।",
    "required_if" => ":आवश्यक है जब विशेषता फ़ील्ड में: अन्य: मान हो।",
    "required_with" => ":आवश्यक है जब विशेषता फ़ील्ड: मान।",
    "required_with_all" => ":आवश्यक है जब विशेषता फ़ील्ड: मान।",
    "required_without" => ":आवश्यक है जब विशेषता फ़ील्ड: मान मौजूद नहीं है।",
    "required_without_all" => ":आवश्यक है जब विशेषता फ़ील्ड: मान मौजूद नहीं है।",
    "same" => ":विशेषता से मेल खाना चाहिए: अन्य।",
    "size" => array(
        "numeric" => ":विशेषता होनी चाहिए: आकार।",
        "file" => ":विशेषता: आकार किलोबाइट होना चाहिए।",
        "string" => ":विशेषता: आकार एक वर्ण होना चाहिए।",
        "array" => ":विशेषता: आकार वस्तु होनी चाहिए।"
    ),
    "unique" => ":विशेषता पहले ही पंजीकृत हो चुकी है।",
    "url" => ":विशेषता प्रारूप अमान्य है।",
    /*
      |--------------------------------------------------------------------------
      | Custom Validation Language Lines
      |--------------------------------------------------------------------------
      |
      | Here you may specify custom validation messages for attributes using the
      | convention "attribute.rule" to name the lines. This makes it quick to
      | specify a specific custom language line for a given attribute rule.
      |
     */
    'custom' => array(),
    /*
      |--------------------------------------------------------------------------
      | Custom Validation Attributes
      |--------------------------------------------------------------------------
      |
      | The following language lines are used to swap attribute place-holders
      | with something more reader friendly such as E-Mail Address instead
      | of "email". This simply helps us make messages a little cleaner.
      |
     */
    'attributes' => array(),
);